In [1]:
import pandas as pd
import numpy as np

In [2]:
# creating a series
a=np.array(['a','b','c','d','e'])
print(a)

['a' 'b' 'c' 'd' 'e']

In [3]:
s=pd.Series(a)

In [4]:
s

0    a
1    b
2    c
3    d
4    e
dtype: object

In [5]:
s=pd.Series(a,index=[10,20,30,40,50])
s

10    a
20    b
30    c
40    d
50    e
dtype: object

In [6]:
# creating a series from dictionary
d={'a':1,'b':2,'c':3,'d':4}
d

{'a': 1, 'b': 2, 'c': 3, 'd': 4}

In [7]:
c=pd.Series(d)
c

a    1
b    2
c    3
d    4
dtype: int64

In [8]:
type(c)

pandas.core.series.Series

In [9]:
b=pd.Series(d,index=['d','f','g','h'])

In [10]:
b

d    4.0
f    NaN
g    NaN
h    NaN
dtype: float64

In [11]:
c['b']

2

In [12]:
type(c)

pandas.core.series.Series

In [13]:
# slicing
c[1:3]

b    2
c    3
dtype: int64

In [14]:
# Dataframe
stu={'Name':['Biswajit','Abhinash','Kamal','Rajendra'],
     'Roll':[1,2,3,4],
     'Chorse':['AIML','Python','java','c++']}

In [15]:
df=pd.DataFrame(stu)

In [16]:
df

       Name  Roll  Chorse
0  Biswajit     1    AIML
1  Abhinash     2  Python
2     Kamal     3    java
3  Rajendra     4     c++

In [17]:
df.head(2)

       Name  Roll  Chorse
0  Biswajit     1    AIML
1  Abhinash     2  Python

In [18]:
df.tail(2)

       Name  Roll Chorse
2     Kamal     3   java
3  Rajendra     4    c++

In [19]:
d=df.rename(columns={'Name':'Stu_name'})
d

   Stu_name  Roll  Chorse
0  Biswajit     1    AIML
1  Abhinash     2  Python
2     Kamal     3    java
3  Rajendra     4     c++

In [20]:
b=pd.DataFrame({'Days':[1,2,np.NaN,4,5],
                'Place':['Puri','Maldiv','Manali','los vagas','Mocow'],
                'Visitors':[8000,4000,5000,3000,7400]})

In [21]:
dt=pd.DataFrame(b)

In [22]:
dt

   Days      Place  Visitors
0   1.0       Puri      8000
1   2.0     Maldiv      4000
2   NaN     Manali      5000
3   4.0  los vagas      3000
4   5.0      Mocow      7400

In [23]:
b['Days'].fillna(3,inplace=True)
b

C:\Users\asus\AppData\Local\Temp\ipykernel_18392\3720099900.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  b['Days'].fillna(3,inplace=True)

   Days      Place  Visitors
0   1.0       Puri      8000
1   2.0     Maldiv      4000
2   3.0     Manali      5000
3   4.0  los vagas      3000
4   5.0      Mocow      7400

In [24]:
b.dtypes

Days        float64
Place        object
Visitors      int64
dtype: object

In [25]:
b.info

<bound method DataFrame.info of    Days      Place  Visitors
0   1.0       Puri      8000
1   2.0     Maldiv      4000
2   3.0     Manali      5000
3   4.0  los vagas      3000
4   5.0      Mocow      7400>

In [29]:
b['Visitors'].sum()

27400

In [31]:
b['Visitors'].mean()

5480.0

In [32]:
b['Visitors'].max()

8000

In [33]:
b.describe(include='all')

            Days Place     Visitors
count   5.000000     5     5.000000
unique       NaN     5          NaN
top          NaN  Puri          NaN
freq         NaN     1          NaN
mean    3.000000   NaN  5480.000000
std     1.581139   NaN  2156.849554
min     1.000000   NaN  3000.000000
25%     2.000000   NaN  4000.000000
50%     3.000000   NaN  5000.000000
75%     4.000000   NaN  7400.000000
max     5.000000   NaN  8000.000000

In [34]:
b.describe(include='O')

       Place
count      5
unique     5
top     Puri
freq       1

In [35]:
df2=pd.DataFrame({'HPI':[70,80,90,50],
                  'IND_GDP':[50,20,10,24],
                  'index':[2001,2002,2003,2004]})
df3=pd.DataFrame({'HPI':[80,70,50,40],
                  'IND_GDP':[40,70,80,24],
                  'index':[2005,2006,2007,2008]})
m1=pd.merge(df2,df3,on='HPI')

In [36]:
m1

   HPI  IND_GDP_x  index_x  IND_GDP_y  index_y
0   70         50     2001         70     2006
1   80         20     2002         40     2005
2   50         24     2004         80     2007

In [37]:
m1=pd.merge(df2,df3,on='index')

In [38]:
m1

Empty DataFrame
Columns: [HPI_x, IND_GDP_x, index, HPI_y, IND_GDP_y]
Index: []

In [41]:
df4=pd.DataFrame({'A':[1,2,3],'B':[90,87,80]})
df5=pd.DataFrame({'A':[5,4,8],'B':[88,45,50]})

In [ ]:
join1=df4.join(df5)
join1

In [43]:
df6=pd.DataFrame(np.random.rand(10,2),
                 index=[1,4,6,9,2,5,3,8,7,0])
df6

          0         1
1  0.554780  0.977080
4  0.351798  0.634505
6  0.866823  0.177178
9  0.993453  0.477844
2  0.919902  0.569209
5  0.421653  0.430282
3  0.384928  0.466355
8  0.715093  0.394437
7  0.803487  0.129637
0  0.035318  0.038282

In [44]:
sort_df6=df6.sort_index(ascending=True)
sort_df6

          0         1
0  0.035318  0.038282
1  0.554780  0.977080
2  0.919902  0.569209
3  0.384928  0.466355
4  0.351798  0.634505
5  0.421653  0.430282
6  0.866823  0.177178
7  0.803487  0.129637
8  0.715093  0.394437
9  0.993453  0.477844